// Задача 10: Напишите программу, которая принимает на вход 
// трёхзначное число и на выходе показывает вторую цифру этого числа.
// 456 -> 5
// 782 -> 8
// 918 -> 1

// Console.WriteLine("Введите трехзначное число");
// int num = Convert.ToInt32(Console.ReadLine());

// if (num >= 100 && num < 1000)
// {
// int numA = (num % 100 - num % 10) / 10;

// Console.WriteLine(numA);
          
// }

// else
// Console.WriteLine("Это не трехзначное число"); 

// ____________________________________________________________________________________

// Задача 13: Напишите программу, которая выводит третью цифру 
// заданного числа или сообщает, что третьей цифры нет.
// 645 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6

// Console.WriteLine("Введите трехзначное число");
// int num = Convert.ToInt32(Console.ReadLine());

// if (num >= 100 && num < 1000)
// {
// int numA = num % 10;

// Console.WriteLine(numA);
// }

// else if (num>=10 && num < 100)

// Console.WriteLine("В данном числе третьей цифры нет");

// __________________________________________________________________________________


// Задача 15: Напишите программу, которая принимает на вход цифру, 
// обозначающую день недели, и проверяет, является ли этот день выходным.
// 6 -> да
// 7 -> да
// 1 -> нет

// Console.WriteLine("Введите число");
// int num=Convert.ToInt32(Console.ReadLine());

// if (num >= 1 && num <=6)
// {
    
//   {Console.WriteLine("Этот день - будний.");}
  
// }

// else if  (num >=6 && num < 8)
// {
// Console.WriteLine("Этот день - выходной.");
// }
// else if  (num > 7)
// Console.WriteLine("Это не день недели.");
